bivex/ArchC/tests/nrf52/nrf52_isa.H
/******************************************************
 * Instruction Set Architecture header file.          *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef _NRF52_ISA_H
#define _NRF52_ISA_H

#include "nrf52_parms.H"
#include "ac_instr.H"
#include "ac_decoder_rt.H"
#include "ac_instr_info.H"
#include "nrf52_arch.H"
#include "nrf52_arch_ref.H"
#include "nrf52_syscall.H"

namespace nrf52_parms
{
class nrf52_isa: public nrf52_arch_ref {
private:
typedef ac_instr<AC_DEC_FIELD_NUMBER> ac_instr_t;

public:
  static ac_dec_field fields[AC_DEC_FIELD_NUMBER];
  static ac_dec_format formats[AC_DEC_FORMAT_NUMBER];
  static ac_dec_list dec_list[AC_DEC_LIST_NUMBER];
  static ac_dec_instr instructions[AC_DEC_INSTR_NUMBER];
  static const ac_instr_info instr_table[AC_DEC_INSTR_NUMBER + 1];

  static const unsigned instr_format_table[AC_DEC_INSTR_NUMBER + 1];

  ac_decoder_full* decoder;

  nrf52_syscall syscall;
  //!Constructor.
  nrf52_isa(nrf52_arch& ref) : nrf52_arch_ref(ref) , syscall(ref) {
    //!Building Decoder.
    decoder = ac_decoder_full::CreateDecoder(nrf52_isa::formats, nrf52_isa::instructions, &ref);
  }

  inline __attribute__((always_inline)) void _behavior_instruction(uint8_t op);

  inline __attribute__((always_inline)) void _behavior_begin();
  inline __attribute__((always_inline)) void _behavior_end();

  inline __attribute__((always_inline)) void _behavior_nrf52_Type_Imm8(uint8_t op, uint8_t subop1, uint8_t rd1, uint8_t imm1);
  inline __attribute__((always_inline)) void _behavior_nrf52_Type_Alu3(uint8_t op, uint8_t subop2, uint8_t rm2, uint8_t rn2, uint8_t rd2);
  inline __attribute__((always_inline)) void _behavior_nrf52_Type_Alu2(uint8_t op, uint8_t subop3, uint8_t rm3, uint8_t rdn3);
  inline __attribute__((always_inline)) void _behavior_nrf52_Type_Mem(uint8_t op, uint8_t subop4, uint8_t imm4, uint8_t rn4, uint8_t rt4);
  inline __attribute__((always_inline)) void _behavior_nrf52_Type_BCond(uint8_t op, uint8_t cond5, int8_t bdisp5);
  inline __attribute__((always_inline)) void _behavior_nrf52_Type_BUnc(uint8_t op, int16_t bdisp6);
  inline __attribute__((always_inline)) void _behavior_nrf52_Type_Special(uint8_t op, uint8_t subop7, uint8_t imm7);

  inline __attribute__((always_inline)) void behavior_movs_imm(uint8_t op, uint8_t subop1, uint8_t rd1, uint8_t imm1);
  inline __attribute__((always_inline)) void behavior_cmp_imm(uint8_t op, uint8_t subop1, uint8_t rd1, uint8_t imm1);
  inline __attribute__((always_inline)) void behavior_adds_imm(uint8_t op, uint8_t subop1, uint8_t rd1, uint8_t imm1);
  inline __attribute__((always_inline)) void behavior_subs_imm(uint8_t op, uint8_t subop1, uint8_t rd1, uint8_t imm1);
  inline __attribute__((always_inline)) void behavior_adds_reg(uint8_t op, uint8_t subop2, uint8_t rm2, uint8_t rn2, uint8_t rd2);
  inline __attribute__((always_inline)) void behavior_subs_reg(uint8_t op, uint8_t subop2, uint8_t rm2, uint8_t rn2, uint8_t rd2);
  inline __attribute__((always_inline)) void behavior_ands_reg(uint8_t op, uint8_t subop3, uint8_t rm3, uint8_t rdn3);
  inline __attribute__((always_inline)) void behavior_eors_reg(uint8_t op, uint8_t subop3, uint8_t rm3, uint8_t rdn3);
  inline __attribute__((always_inline)) void behavior_orrs_reg(uint8_t op, uint8_t subop3, uint8_t rm3, uint8_t rdn3);
  inline __attribute__((always_inline)) void behavior_muls_reg(uint8_t op, uint8_t subop3, uint8_t rm3, uint8_t rdn3);
  inline __attribute__((always_inline)) void behavior_ldr_imm(uint8_t op, uint8_t subop4, uint8_t imm4, uint8_t rn4, uint8_t rt4);
  inline __attribute__((always_inline)) void behavior_str_imm(uint8_t op, uint8_t subop4, uint8_t imm4, uint8_t rn4, uint8_t rt4);
  inline __attribute__((always_inline)) void behavior_beq(uint8_t op, uint8_t cond5, int8_t bdisp5);
  inline __attribute__((always_inline)) void behavior_bne(uint8_t op, uint8_t cond5, int8_t bdisp5);
  inline __attribute__((always_inline)) void behavior_bcs(uint8_t op, uint8_t cond5, int8_t bdisp5);
  inline __attribute__((always_inline)) void behavior_bcc(uint8_t op, uint8_t cond5, int8_t bdisp5);
  inline __attribute__((always_inline)) void behavior_bmi(uint8_t op, uint8_t cond5, int8_t bdisp5);
  inline __attribute__((always_inline)) void behavior_bpl(uint8_t op, uint8_t cond5, int8_t bdisp5);
  inline __attribute__((always_inline)) void behavior_bge(uint8_t op, uint8_t cond5, int8_t bdisp5);
  inline __attribute__((always_inline)) void behavior_blt(uint8_t op, uint8_t cond5, int8_t bdisp5);
  inline __attribute__((always_inline)) void behavior_b_unc(uint8_t op, int16_t bdisp6);
  inline __attribute__((always_inline)) void behavior_wfe(uint8_t op, uint8_t subop7, uint8_t imm7);
  inline __attribute__((always_inline)) void behavior_sev(uint8_t op, uint8_t subop7, uint8_t imm7);
  inline __attribute__((always_inline)) void behavior_wfi(uint8_t op, uint8_t subop7, uint8_t imm7);
  inline __attribute__((always_inline)) void behavior_bkpt_halt(uint8_t op, uint8_t subop7, uint8_t imm7);

};
};



#endif //_NRF52_ISA_H

